       01 N01-REC.
          05 CNT                  PIC 9(2).
          05 ITEMS OCCURS 0 TO 10 TIMES DEPENDING ON CNT.
             10 ITEM              PIC X(2).
