       01 TC03-REC.
          05 FIELD-A               PIC X(4).
          05 FIELD-B REDEFINES FIELD-A.
             10 FIELD-B1           PIC 9(4).
