       01 TC05-REC.
          05 STATUS-CODE           PIC X.
             88 STATUS-OK          VALUE 'Y'.
             88 STATUS-NOT-OK      VALUE 'N'.
